In [1]:
import pandas as pd
import numpy as np
import os

In [2]:
train_data=pd.read_csv("../data/raw/train.csv",index_col="PassengerId")
train_data.head(5)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
test_data=pd.read_csv("../data/raw/test.csv",index_col="PassengerId")
test_data['Survived']=888
test_data.head(5)

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
PassengerId,,,,,,,,,,,
892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q,888
893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,888
894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q,888
895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S,888
896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S,888

In [4]:
df_data=pd.concat([train_data,test_data],axis=0)
df_data.head(5)

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

,Age,Cabin,Embarked,Fare,Name,Parch,Pclass,Sex,SibSp,Survived,Ticket
PassengerId,,,,,,,,,,,
1,22.0,NaN,S,7.2500,"Braund, Mr. Owen Harris",0,3,male,1,0,A/5 21171
2,38.0,C85,C,71.2833,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,1,female,1,1,PC 17599
3,26.0,NaN,S,7.9250,"Heikkinen, Miss. Laina",0,3,female,0,1,STON/O2. 3101282
4,35.0,C123,S,53.1000,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,1,female,1,1,113803
5,35.0,NaN,S,8.0500,"Allen, Mr. William Henry",0,3,male,0,0,373450

In [5]:
df_data.tail(5)

,Age,Cabin,Embarked,Fare,Name,Parch,Pclass,Sex,SibSp,Survived,Ticket
PassengerId,,,,,,,,,,,
1305,NaN,NaN,S,8.0500,"Spector, Mr. Woolf",0,3,male,0,888,A.5. 3236
1306,39.0,C105,C,108.9000,"Oliva y Ocana, Dona. Fermina",0,1,female,0,888,PC 17758
1307,38.5,NaN,S,7.2500,"Saether, Mr. Simon Sivertsen",0,3,male,0,888,SOTON/O.Q. 3101262
1308,NaN,NaN,S,8.0500,"Ware, Mr. Frederick",0,3,male,0,888,359309
1309,NaN,NaN,C,22.3583,"Peter, Master. Michael J",1,3,male,1,888,2668

In [6]:
df_data.drop(['Name','Ticket','Cabin'],axis=1,inplace=True)
df_data.head(5)

              Age Embarked     Fare  Parch  Pclass     Sex  SibSp  Survived
PassengerId
1            22.0        S   7.2500      0       3    male      1         0
2            38.0        C  71.2833      0       1  female      1         1
3            26.0        S   7.9250      0       3  female      0         1
4            35.0        S  53.1000      0       1  female      1         1
5            35.0        S   8.0500      0       3    male      0         0

In [7]:
df_data["Familysize"]=df_data['Parch']+df_data['SibSp']

In [8]:
df_data.head(5)

,Age,Embarked,Fare,Parch,Pclass,Sex,SibSp,Survived,Familysize
PassengerId,,,,,,,,,
1,22.0,S,7.2500,0,3,male,1,0,1
2,38.0,C,71.2833,0,1,female,1,1,1
3,26.0,S,7.9250,0,3,female,0,1,0
4,35.0,S,53.1000,0,1,female,1,1,1
5,35.0,S,8.0500,0,3,male,0,0,0

In [9]:
df_data.drop(['Parch','SibSp'],axis=1,inplace=True)
df_data.head(5)

              Age Embarked     Fare  Pclass     Sex  Survived  Familysize
PassengerId
1            22.0        S   7.2500       3    male         0           1
2            38.0        C  71.2833       1  female         1           1
3            26.0        S   7.9250       3  female         1           0
4            35.0        S  53.1000       1  female         1           1
5            35.0        S   8.0500       3    male         0           0

In [10]:
df_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1309 entries, 1 to 1309
Data columns (total 7 columns):
Age           1046 non-null float64
Embarked      1307 non-null object
Fare          1308 non-null float64
Pclass        1309 non-null int64
Sex           1309 non-null object
Survived      1309 non-null int64
Familysize    1309 non-null int64
dtypes: float64(2), int64(3), object(2)
memory usage: 81.8+ KB

In [11]:
df_data.Age.fillna(df_data['Age'].median(),inplace=True)

In [12]:
df_data.Fare.fillna(df_data['Fare'].median(),inplace=True)

In [13]:
df_data.Embarked.value_counts()

S    914
C    270
Q    123
Name: Embarked, dtype: int64

In [14]:
df_data.Embarked.fillna('S',inplace=True)

In [15]:
df_data=pd.get_dummies(df_data,['Embarked','Sex'])

In [16]:
df_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1309 entries, 1 to 1309
Data columns (total 10 columns):
Age           1309 non-null float64
Fare          1309 non-null float64
Pclass        1309 non-null int64
Survived      1309 non-null int64
Familysize    1309 non-null int64
Embarked_C    1309 non-null uint8
Embarked_Q    1309 non-null uint8
Embarked_S    1309 non-null uint8
Sex_female    1309 non-null uint8
Sex_male      1309 non-null uint8
dtypes: float64(2), int64(3), uint8(5)
memory usage: 67.8 KB

In [17]:
df_data.head(5)

,Age,Fare,Pclass,Survived,Familysize,Embarked_C,Embarked_Q,Embarked_S,Sex_female,Sex_male
PassengerId,,,,,,,,,,
1,22.0,7.2500,3,0,1,0,0,1,0,1
2,38.0,71.2833,1,1,1,1,0,0,1,0
3,26.0,7.9250,3,1,0,0,0,1,1,0
4,35.0,53.1000,1,1,1,0,0,1,1,0
5,35.0,8.0500,3,0,0,0,0,1,0,1

In [18]:
ColumnName =    [ColumnName for ColumnName in df_data if ColumnName != 'Survived'] + ['Survived']
ColumnName

['Age',
 'Fare',
 'Pclass',
 'Familysize',
 'Embarked_C',
 'Embarked_Q',
 'Embarked_S',
 'Sex_female',
 'Sex_male',
 'Survived']

In [19]:
df_data=df_data[ColumnName]
df_data.head(5)

,Age,Fare,Pclass,Familysize,Embarked_C,Embarked_Q,Embarked_S,Sex_female,Sex_male,Survived
PassengerId,,,,,,,,,,
1,22.0,7.2500,3,1,0,0,1,0,1,0
2,38.0,71.2833,1,1,1,0,0,1,0,1
3,26.0,7.9250,3,0,0,0,1,1,0,1
4,35.0,53.1000,1,1,0,0,1,1,0,1
5,35.0,8.0500,3,0,0,0,1,0,1,0

In [20]:
df_data[df_data.Survived!=888].to_csv("../data/processed/train.csv")
test_data=df_data[df_data.Survived==888]
test_data.drop(['Survived'],axis=1,inplace=True)
test_data.to_csv("../data/processed/test.csv")

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\frame.py:3697: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  errors=errors)

In [21]:
df

NameError: name 'df' is not defined